NextFOAM-2506/tutorials/multiphase/interFoam/laminar/waves/waveMakerSolitary/system/setFieldsDict
/*--------------------------------*- C++-*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box ( -10.000 -10.000 -10.000 ) ( 250.000 250.000 0.2 );
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);


// ************************************************************************* //
